app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES ('aaa', '2025-12-22 10:51:34.201481', '2025-12-22 10:51:34.201481') RETURNING "id"